Hi @MilesTails , thank you for raising this issue. Please use escape characters and double quotes to enclose the value inside. This is indeed a bit strange, it comes from the requirements of FortiOS API, the documentation example has been updated to show its usage [doc: fortios_system_dnsdatabase](https://registry.terraform.io/providers/fortinetdev/fortios/latest/docs/resources/fortios_system_dnsdatabase) .

**Example1 and validation:**

```
# cat maintst.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "rGqsgj9Qmh3dwfQdc8hd3t3G6xG3N5"
}

resource "fortios_system_dnsdatabase" "trname" {
  authoritative = "enable"
  contact       = "hostmaster"
  domain        = "s.com"
  ip_master     = "0.0.0.0"
  name          = "1"
  primary_name  = "dns"
  source_ip     = "0.0.0.0"
  status        = "enable"
  ttl           = 86400
  type          = "master"
  view          = "shadow"
  forwarder     = "\"9.9.9.9\" "
  dns_entry {
    type     = "MX"
    ttl      = 3
    hostname = "sghsgh.com"
  }
}


# terraform apply
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_system_dnsdatabase.trname will be created
  + resource "fortios_system_dnsdatabase" "trname" {
      + allow_transfer = (known after apply)
      + authoritative  = "enable"
      + contact        = "hostmaster"
      + domain         = "s.com"
      + forwarder      = "\"9.9.9.9\" "
      + id             = (known after apply)
      + ip_master      = "0.0.0.0"
      + name           = "1"
      + primary_name   = "dns"
      + source_ip      = "0.0.0.0"
      + status         = "enable"
      + ttl            = 86400
      + type           = "master"
      + view           = "shadow"

      + dns_entry {
          + canonical_name = (known after apply)
          + hostname       = "sghsgh.com"
          + id             = (known after apply)
          + ip             = (known after apply)
          + ipv6           = (known after apply)
          + preference     = (known after apply)
          + status         = (known after apply)
          + ttl            = 3
          + type           = "MX"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_system_dnsdatabase.trname: Creating...
fortios_system_dnsdatabase.trname: Creation complete after 0s [id=1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

# terraform plan
  ----
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_system_dnsdatabase.trname: Refreshing state... [id=1]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

# 
```

**Example2:**
```
resource "fortios_system_dnsdatabase" "trname" {
  authoritative = "enable"
  contact       = "hostmaster"
  domain        = "s.com"
  ip_master     = "0.0.0.0"
  name          = "1"
  primary_name  = "dns"
  source_ip     = "0.0.0.0"
  status        = "enable"
  ttl           = 86400
  type          = "master"
  view          = "shadow"
  forwarder     = "\"9.9.9.9\" \"8.8.8.8\" "
  dns_entry {
    type     = "MX"
    ttl      = 3
    hostname = "sghsgh.com"
  }
}

```



